# Создать калькулятор для работы с рациональными и комплексными числами,
# организовать меню, добавив в неё систему логирования.

# В рамках этого обсуждения студентам надо нарисовать “архитектуру” (например, в виде блок-схемы)
# для работы данного приложения.






# import controller as c

# c.button_click()
# main




# # import model_mult as model      # Для умножения
# # import model_sum as model       # Для сложения
# import model_sub as model       # Для вычитания

# import view

# def button_click():
# def view_data(data, title):
#     print(f'{title} = {data}')


# x=0
# y=0

# def init(a, b):
#     global x
#     global y
#     x=a


#     y=b

# def do_it():
# 	return x*y


