# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:    - [2, 3, 4, 5, 6] => [12, 15, 16];    - [2, 3, 5, 6] => [12, 15]

col = [2,4,3,7,9,1,4,2]
col1 = []
count = 1
n = 0
m = -1
for i in col:
    if count <= int(len(col) / 2):
        col1.append(col[n] * col[m])
        n += 1
        m -= 1
        count += 1
print(col1)


